ednieuw/ESP32Communications/ESP32Arduino_CommV013/ESP32Arduino_CommV013.ino
    case 'Z':                                                                                 // Start WPS
      snprintf(sptext, sizeof(sptext), "**** Start WPS on your router");
      WiFi.onEvent(WiFiEvent);
      WiFi.mode(WIFI_STA);
      Tekstprintln("Starting WPS");
      wpsInitConfig();
      wpsStart();
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Tekstprintln("\n*********\n ESP restarting\n*********\n");
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
 
    case '#':                                                                                 // *** Empty *** 
        snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '$':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        snprintf(sptext, sizeof(sptext), "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

     case '^':                                                                                 // *** Empty ***
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        if(GetNTPtime(false))  SetDS3231Time();                                               // Only set time in DS3231 if time is valid
        SetRTCTime();
        PrintAllClockTimes();
        sptext[0] =0 ;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault &. ****");
      break;
 
    case '(':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case ')':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case '{':  
      if (Mem.UseRotary==3 || Mem.UseRotary==4)
       {
         StartIRLearning();                                                                   // Initializes learning mode,Resets all button data, Prompts for first button
         snprintf(sptext, sizeof(sptext), "Learning IR finished");
       }
      else snprintf(sptext, sizeof(sptext), "IR remote is OFF (Turn it on with H03 or H04 )\nOr no IR remote is installed");
      break;

    case '}':                                                                                 // *** Empty ***
      if(len == 1) 
       {
       // snprintf(sptext, sizeof(sptext), "--- %s ---", Mem.ByteFutureX ? "OFF" : "ON");
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

   case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        snprintf(sptext, sizeof(sptext), "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter + ****");
      break;
      

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter = ****");
      break;     

    case '0': 
    case '1': 
    case '2':                                                             // Time entry compatibility mode
      if(len == 6)                                                        // The first digit of InputString is 0, 1 or 2
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       }   
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
}
InputString = "";
}

//--------------------------------------------                                                //
// COMMON Print time input method
// Rotary, Membrane or IR-remote
//--------------------------------------------
void PrintTimeInputMethod(byte Im)
{
  char Method[20];
  switch(Im)
  {
    case 0: strcpy(Method, "None");            break;
    case 1: strcpy(Method, "Rotary");          break;
    case 2: strcpy(Method, "Membrane");        break;
    case 3: strcpy(Method, "Large IR-remote"); break;
    case 4: strcpy(Method, "Tiny Ir-remote");  break;     
   default: strcpy(Method, "Error");
  }
  sprintf(sptext, "Time inputMethod: %s", Method);
  Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 PrintLine(35); 
 printHeaps(); 
 PrintAllMappings();                                                                          // Print the IR remote keys 
 Tekstprintlnf(" TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                 
 Tekstprintlnf("  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH);                  
 Tekstprintlnf("  LanguageChoice: %d",Mem.LanguageChoice);                  
 Tekstprintlnf("    LightReducer: %d",Mem.LightReducer);                    
 Tekstprintlnf(" LowerBrightness: %d",Mem.LowerBrightness);                 
 Tekstprintlnf(" UpperBrightness: %d",Mem.UpperBrightness);                 
 for (int i=0;i<12;i++) { Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 for (int i=12;i<24;i++){ Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 Tekstprintlnf("   DisplayChoice: %d",Mem.DisplayChoice);                                                                                      
 Tekstprintlnf("           BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");            
 Tekstprintlnf("           NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");            
 Tekstprintlnf("          WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");           
 Tekstprintlnf("     StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");      
 Tekstprintlnf("    MCUrestarted: %d",Mem.MCUrestarted );                   
 Tekstprintlnf("    LoopRebooted: %d",Mem.LoopRebooted );                   
 Tekstprintlnf("     ByteFuture1: %d",Mem.ByteFuture1 );                    
 Tekstprintlnf(" Time per minute: %s",Mem.TimeMinute ? "OFF" : "ON");        
 Tekstprintlnf("         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");         
 Tekstprintlnf("       UseRotary: %d",Mem.UseRotary);                       
 PrintTimeInputMethod(Mem.UseRotary);
 Tekstprintlnf("       UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");        
 Tekstprintlnf("       LED strip: %s", Mem.LEDstrip?"WS2812":"SK6812" );    
 Tekstprintlnf("      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO");  
 Tekstprintlnf("          NoExUl: %s", Mem.NoExUl ? "ON" : "OFF");          
 byte wc = Mem.WIFIcredentials; 
 Tekstprintlnf(" WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                   wc==3? "in AP not SET":"Unknown code");   
 Tekstprintlnf("      IntFuture2: %d",Mem.IntFuture2 );                     
 Tekstprintlnf("      IntFuture3: %d",Mem.IntFuture3 );                     
 Tekstprintlnf("      HET IS WAS: %s", Mem.HetIsWasOff ? "OFF" : "ON");     
 Tekstprintlnf("       EDSOFT is: %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");    
 Tekstprintlnf("   RandomDisplay: %s", Mem.RandomDisplay? "ON" : "OFF");    
 Tekstprintlnf("WIFInoConnection: %d", Mem.WIFInoConnection);               
 Tekstprintlnf("UseBLELongString: %s",Mem.UseBLELongString?"ON":"OFF");     
 Tekstprintlnf("     Font colour: 0X%08" PRIX32, Mem.OwnColour);            
 Tekstprintlnf("    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter);          
 Tekstprintlnf("      BackGround: 0X%08" PRIX32,Mem.BackGround);            
 Tekstprintlnf("            SSID: %s",Mem.SSID);                            
 // Tekstprintlnf("BackGround: %s",Mem.Password);                           
 Tekstprintlnf("BLEbroadcastName: %s",Mem.BLEbroadcastName);                
 Tekstprintlnf("        Timezone: %s",Mem.Timezone);                        
 Tekstprintlnf("        Checksum: %d",Mem.Checksum);                        
 sptext[0]=0;                                                                                 // Suppress a second print of sptext
}
//--------------------------------------------                                                //
// LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin)/16;
}
//--------------------------------------------                                                //
// CLOCK Say the time and load the LEDs 
// with the proper colour and intensity
// If ClearLEDstrip is true a new minute starts
//--------------------------------------------
void Displaytime(void)
{ 
 ClearScreen();                                                                               // Start by clearing the display to a known state   
 GetTijd(true); //Tekstprintln(""); 
}
//--------------------------------------------                                                //
// CLOCK Dim the leds measured by the LDR and print values
// LDR reading are between 0 and 255. The Brightness send to the LEDs is between 0 and 255
//--------------------------------------------
void DimLeds(bool print) 
{ 
  int LDRread = ReadLDR();                                                                    // ESP32 analoge read is between 0 - 4096, reduce it to 0-1024                                                                                                   
  int LDRavgread = (4 * Previous_LDR_read + LDRread ) / 5;                                    // Read lightsensor and avoid rapid light intensity changes
  Previous_LDR_read = LDRavgread;                                                             // by using the previous reads
  OutPhotocell = (uint32_t)((Mem.LightReducer * sqrt(255*LDRavgread))/100);                   // Linear --> hyperbolic with sqrt. Result is between 0-255
  MinPhotocell = min(MinPhotocell, LDRavgread);                                               // Lowest LDR measurement
  MaxPhotocell = max(MaxPhotocell, LDRavgread);                                               // Highest LDR measurement
  OutPhotocell = constrain(OutPhotocell, Mem.LowerBrightness, Mem.UpperBrightness);           // Keep result between lower and upper boundery en calc percentage
  SumLDRreadshour += LDRavgread;    NoofLDRreadshour++;                                       // For statistics LDR readings per hour
  if(print)
  {
  // snprintf(sptext, sizeof(sptext),"LDR:%3d Avg:%3d (%3d-%3d) Out:%3d=%2d%% Loop(%ld) ",
  //      LDRread,LDRavgread,MinPhotocell,MaxPhotocell,OutPhotocell,(int)(OutPhotocell/2.55),Loopcounter);    
 if (Mem.UseDS3231)   snprintf(sptext, sizeof(sptext),"LDR:%3d->%2d%% %5lu l/s %0.0fC ",
               LDRread,(int)(OutPhotocell*100/255),Loopcounter,RTCklok.getTemperature()); 
 else                 snprintf(sptext, sizeof(sptext),"LDR:%3d->%2d%% %5lu l/s M %0.2f kB ",
               LDRread,(int)(OutPhotocell*100/255),Loopcounter, (float)ESP.getFreeHeap()/1024);   
   Tekstprint(sptext);
   PrintTimeHMS();    
  }
 if(LEDsAreOff) OutPhotocell = 0;
 SetBrightnessLeds(OutPhotocell);     // values between 0 and 255
}

// --------------------Colour Clock Light functions -----------------------------------
//--------------------------------------------                                                //
// LED Set color for LEDs in strip and print tekst
//---------------------------------------------
void ColorLeds(char const *Tekst, int FirstLed, int LastLed, uint32_t RGBWColor)
{ 
 Stripfill(RGBWColor, FirstLed, ++LastLed - FirstLed );                                        //
 if (!NoTextInLeds && !Mem.TimeMinute && strlen(Tekst) > 0 )
     { snprintf(sptext, sizeof(sptext),"%s ",Tekst); Tekstprint(sptext); }                                      // Print the text  
}
//--------------------------------------------
// LED Set color for one LED
//--------------------------------------------
void ColorLed(int Lednr, uint32_t RGBWColor)
{   
 Stripfill(RGBWColor, Lednr, 1 );
}
//--------------------------------------------                                                //
// LED Clear display settings of the LEDs
//--------------------------------------------
void LedsOff(void) 
{ 
 Stripfill(0, 0, NUM_LEDS );                                                                  // 
}
//--------------------------------------------                                                //
// LED Turn On and the LEDs off after Delaymsec milliseconds
//--------------------------------------------
void Laatzien(int Delaymsec) 
{ 
 ShowLeds(); 
 delay(Delaymsec);
 LedsOff(); 
 CheckDevices();                                                                              // Check for input from input devices
}

//--------------------------------------------                                                //
// LED Push data in LED strip to commit the changes
//--------------------------------------------
void ShowLeds(void) { LEDstrip.show(); }
//--------------------------------------------                                                //
// LED Set brighness of LEDs
//--------------------------------------------
void SetBrightnessLeds(byte Bright)
{
 LEDstrip.setBrightness(Bright);                                                              // Set brightness of LEDs   
 ShowLeds();
}
//--------------------------------------------
// LED Fill the strip array
//--------------------------------------------
void Stripfill(uint32_t RGBWColor, int FirstLed, int NoofLEDs)
{   
 LEDstrip.fill(RGBWColor, FirstLed, NoofLEDs);
}
//--------------------------------------------
// LED Strip Get Pixel Color 
//--------------------------------------------
uint32_t StripGetPixelColor(int Lednr)
{
 return(LEDstrip.getPixelColor(Lednr));
}
//--------------------------------------------                                                //
// LED Synchronize the colour of the LEDstrip with the Status LED
// Used during Setup(). if LEDcolour == 9999 -> clear the display
//--------------------------------------------
void LEDstartup(uint32_t LEDColour)
{
 static uint32_t ProgressLedNr = 0;
 if (LEDColour == CLEARLEDSTARTUP)  
    for(int n = ProgressLedNr-1; n>=0; n--)
      {
       ColorLed(n,0); 
       ShowLeds(); 
       delay(200);
      }
 else
   {
    ColorLed(ProgressLedNr++,LEDColour); 
    ShowLeds();   
    SetStatusLED(Cred(LEDColour),Cgreen(LEDColour),Cblue(LEDColour));  
   }
}

//--------------------------------------------                                                //
// LED convert HSV to RGB  h is from 0-360, s,v values are 0-1
// r,g,b values are 0-255
//--------------------------------------------
/**
 * @brief Convert HSV values to packed RGBW format (white = 0).
 * @param H Hue angle (0–360)
 * @param S Saturation (0–1)
 * @param V Value/Brightness (0–1)
 * @return Packed RGBW uint32_t value
 */
uint32_t HSVToRGB(double H, double S, double V) 
{
 int i;
 double r, g, b, f, p, q, t;
 if (S == 0)  {r = V;  g = V;  b = V; }
 else
  {
   H >= 360 ? H = 0 : H /= 60;
   i = (int) H;
   f = H - i;
   p = V * (1.0 -  S);
   q = V * (1.0 - (S * f));
   t = V * (1.0 - (S * (1.0 - f)));
   switch (i) 
    {
     case 0:  r = V;  g = t;  b = p;  break;
     case 1:  r = q;  g = V;  b = p;  break;
     case 2:  r = p;  g = V;  b = t;  break;
     case 3:  r = p;  g = q;  b = V;  break;
     case 4:  r = t;  g = p;  b = V;  break;
     default: r = V;  g = p;  b = q;  break;
    }
  }
return FuncCRGBW((int)(r*255), (int)(g*255), (int)(b*255), 0 );                                // R, G, B, W 
}
//--------------------------------------------                                                //
// LED function to make RGBW colour
//--------------------------------------------
uint32_t FuncCRGBW( uint32_t Red, uint32_t Green, uint32_t Blue, uint32_t White)
{ 
 return ( (White<<24) + (Red << 16) + (Green << 8) + Blue );
}
//--------------------------------------------                                                //
// LED functions to extract RGBW colours
//--------------------------------------------
 uint8_t Cwhite(uint32_t c) { return (c >> 24);}
 uint8_t Cred(  uint32_t c) { return (c >> 16);}
 uint8_t Cgreen(uint32_t c) { return (c >> 8); }
 uint8_t Cblue( uint32_t c) { return (c);      }


//--------------------------------------------                                                //
//  DISPLAY Clear the display
//--------------------------------------------
void ClearScreen(void)
{
 LedsOff();
}

//--------------------------------------------                                                //
// DISPLAY Initialyse the LEDstrip for WS2812 or SK6812 LEDs
//--------------------------------------------
void StartLeds(void) 
{
 switch (Mem.LEDstrip)
    {
      case 0: LEDstrip = LED6812strip; 
              white  = 0xFF000000; 
              lgray  = 0x66000000;  
              gray   = 0x33000000;                                                            // The SK6812 LED has a white LED that is pure white
              dgray  = 0x22000000;
              wgray  = 0xAA000000; 

      break;
      case 1: LEDstrip = LED2812strip; 
              white  = 0xFFFFFF;
              lgray  = 0x666666;                                                              // R, G and B on together gives white light
              gray   = 0x333333;
              dgray  = 0x222222;
              wgray  = 0xAAAAAA;         
      break;
     default: LEDstrip = LED6812strip;
              white  = 0xFF000000; 
              lgray  = 0x66000000;  
              gray   = 0x33000000;                                                            // The SK6812 LED has a white LED that is pure white
              dgray  = 0x22000000; 
              wgray  = 0xAA000000;     
    }
snprintf(sptext, sizeof(sptext),"LED strip is %s", Mem.LEDstrip?"WS2812":"SK6812" ); Tekstprintln(sptext);
LEDstrip.begin();
LEDstrip.setBrightness(16);  
LedsOff();                                                                                    // Set initial brightness of LEDs  (0-255)  
ShowLeds();
}

//--------------------------------------------                                                //
// CLOCK In- or decrease light intensity value i.e. Slope
//--------------------------------------------
void WriteLightReducer(int amount)
{
 int value = Mem.LightReducer + amount;                                                       // Prevent byte overflow by making it an integer before adding
 Mem.LightReducer = (byte) constrain(value,5, 250);                                           // Between 5 and 250
 snprintf(sptext, sizeof(sptext),"Max brightness: %3d%%",Mem.LightReducer);
 Tekstprintln(sptext);
}
//--------------------------- Time functions --------------------------
 time_t now;
 const char* monthNames[] = { "Jan","Feb","Mar","Apr","May","Jun",
                              "Jul","Aug","Sep","Oct","Nov","Dec"};
//--------------------------------------------                                                //
// TIME Initialize time system (DS3231 + NTP + internal RTC)
// First set system time to compile time, then to DS3231, then to NTP if available
//--------------------------------------------------------------------
void InitTimeSystem(void)
{
  SetSystemTimeToCompileTime();                                                               //   CompileTime = DateTime(__DATE__, __TIME__);    
  DS3231Installed = IsDS3231I2Cconnected();
  snprintf(sptext, sizeof(sptext), "External RTC module %s found", DS3231Installed ? "IS" : "NOT");
  Tekstprintln(sptext);
  if (DS3231Installed) RTCklok.begin();
  if (DS3231Installed ) //&& Mem.UseDS3231)
   {
    GetDS3231Time(true);
    SetSystemTime(mktime(&timeinfo));                                                         // Sync ESP32 RTC from DS3231 to have a better time
   }
  if (Mem.NTPOn && WiFi.isConnected())
   {
   GetNTPtime(false);
   SetSystemTime(mktime(&timeinfo));                                                          // Sync ESP32 RTC from NTP
   if (DS3231Installed)
     {
      DateTime Inow = RTCklok.now();
      if (RTCklok.lostPower()) SetDS3231Time();
      if (timeinfo.tm_year > (2024 - 1900) && Inow.year() < 2025) SetDS3231Time();            // Sync DS3231 if time is years too old
     }
  }
  else
  {
    time(&now);
    localtime_r(&now, &timeinfo);
  }
}

//--------------------------------------------                                                //                                               
// TIME Set system time to compile time using basic functions
//--------------------------------------------
void SetSystemTimeToCompileTime(void)
{
 struct tm Tm;
 time_t Now;
 
 const char* MonthNames = "JanFebMarAprMayJunJulAugSepOctNovDec";                             // Parse __DATE__ and __TIME__ macros
 char MonthStr[4];
 sscanf(__DATE__, "%s %d %d", MonthStr, &Tm.tm_mday, &Tm.tm_year);                            // Parse "Nov 08 2025"
 sscanf(__TIME__, "%d:%d:%d", &Tm.tm_hour, &Tm.tm_min, &Tm.tm_sec);                           // Parse "14:30:45"
 Tm.tm_year -= 1900;                                                                          // Years since 1900
 Tm.tm_mon = (strstr(MonthNames, MonthStr) - MonthNames) / 3;                                 // Month 0-11
 Tm.tm_isdst = -1;                                                                            // Auto-determine DST
 Now = mktime(&Tm);                                                                           // Convert to time_t
 struct timeval Tv = { .tv_sec = Now, .tv_usec = 0 };
 settimeofday(&Tv, NULL);                                                                      // settimeofday(&tv, nullptr) This is the actual system clock update
 localtime_r(&Now, &timeinfo);                                                                 // This is independent of setting the system time. It converts the UNIX timestamp into the timeinfo struct so your program can use it.
 snprintf(sptext, sizeof(sptext), "System time set to compile time: %s %s", __DATE__, __TIME__);
 Tekstprintln(sptext);
 PrintRTCTime();  Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// TIME Get current time from best available source
//--------------------------------------------------------------------
time_t GetTijd(bool printit)
{
  if (Mem.UseDS3231 && DS3231Installed)     { GetDS3231Time(false);  }
  else if (Mem.NTPOn && WiFi.isConnected()) { getLocalTime(&timeinfo);  }
  else  {    time(&now);                      localtime_r(&now, &timeinfo);  }
  time_t t = mktime(&timeinfo);
  if (printit) {PrintRTCTime();  Tekstprintln(sptext);}
  return t;
}

